gillwei7/QAR87_NXP_RT685_main/BT_Audio/evkmimxrt685_a2dp_sink_cm33/source/pin_mux.c
    const uint32_t SWO = (/* Pin is configured as PIO0_0 */
                          IOPCTL_PIO_FUNC0 |
                          /* Disable pull-up / pull-down function */
                          IOPCTL_PIO_PUPD_DI |
                          /* Enable pull-down function */
                          IOPCTL_PIO_PULLDOWN_EN |
                          /* Disable input buffer function */
                          IOPCTL_PIO_INBUF_DI |
                          /* Normal mode */
                          IOPCTL_PIO_SLEW_RATE_NORMAL |
                          /* Normal drive */
                          IOPCTL_PIO_FULLDRIVE_DI |
                          /* Analog mux is disabled */
                          IOPCTL_PIO_ANAMUX_DI |
                          /* Pseudo Output Drain is disabled */
                          IOPCTL_PIO_PSEDRAIN_DI |
                          /* Input function is not inverted */
                          IOPCTL_PIO_INV_DI);
    /* PORT0 PIN0 (coords: H3) is configured as PIO0_0 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_SWO_PORT, BOARD_INITPINS_SWO_PIN, SWO);

    const uint32_t SD_CD = (/* Pin is configured as PIO0_10 */
                            IOPCTL_PIO_FUNC0 |
                            /* Disable pull-up / pull-down function */
                            IOPCTL_PIO_PUPD_DI |
                            /* Enable pull-down function */
                            IOPCTL_PIO_PULLDOWN_EN |
                            /* Enables input buffer function */
                            IOPCTL_PIO_INBUF_EN |
                            /* Normal mode */
                            IOPCTL_PIO_SLEW_RATE_NORMAL |
                            /* Normal drive */
                            IOPCTL_PIO_FULLDRIVE_DI |
                            /* Analog mux is disabled */
                            IOPCTL_PIO_ANAMUX_DI |
                            /* Pseudo Output Drain is disabled */
                            IOPCTL_PIO_PSEDRAIN_DI |
                            /* Input function is not inverted */
                            IOPCTL_PIO_INV_DI);
    /* PORT0 PIN10 (coords: E2) is configured as PIO0_10 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_SD_CD_PORT, BOARD_INITPINS_SD_CD_PIN, SD_CD);

    const uint32_t port0_pin11_config = (/* Pin is configured as PIO0_11 */
                                         IOPCTL_PIO_FUNC0 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT0 PIN11 (coords: E1) is configured as PIO0_11 */
    IOPCTL_PinMuxSet(IOPCTL, 0U, 11U, port0_pin11_config);

    const uint32_t WL_REG_ON = (/* Pin is configured as PIO0_12 */
                                IOPCTL_PIO_FUNC0 |
                                /* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_DI |
                                /* Enable pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Normal mode */
                                IOPCTL_PIO_SLEW_RATE_NORMAL |
                                /* Normal drive */
                                IOPCTL_PIO_FULLDRIVE_DI |
                                /* Analog mux is disabled */
                                IOPCTL_PIO_ANAMUX_DI |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI);
    /* PORT0 PIN12 (coords: K1) is configured as PIO0_12 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_WL_REG_ON_PORT, BOARD_INITPINS_WL_REG_ON_PIN, WL_REG_ON);

    const uint32_t SD_DAT1 = (/* Pin is configured as PIO0_13 */
                              IOPCTL_PIO_FUNC0 |
                              /* Disable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_DI |
                              /* Enable pull-down function */
                              IOPCTL_PIO_PULLDOWN_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Normal drive */
                              IOPCTL_PIO_FULLDRIVE_DI |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT0 PIN13 (coords: G4) is configured as PIO0_13 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_SD_DAT1_PORT, BOARD_INITPINS_SD_DAT1_PIN, SD_DAT1);

